Revit 2026 API

# BuiltInFailuresOffsetFacesCellLegacyFailures Class

---

Failures related to offset faces operations.

SystemObject Autodesk.Revit.DBBuiltInFailuresOffsetFacesCellLegacyFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class OffsetFacesCellLegacyFailures
```
```vb
Public NotInheritable Class OffsetFacesCellLegacyFailures
```
```cpp
public ref class OffsetFacesCellLegacyFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type OffsetFacesCellLegacyFailures = class end
```

The BuiltInFailuresOffsetFacesCellLegacyFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OffsetFaceFailed |  |

#### Reference

Autodesk.Revit.DB Namespace